; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	thermograph2 - mode
	spectrograph0 - mode
	thermograph1 - mode
	image3 - mode
	GroundStation4 - direction
	GroundStation5 - direction
	GroundStation1 - direction
	GroundStation0 - direction
	Star6 - direction
	Star3 - direction
	GroundStation2 - direction
	Star7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Star12 - direction
	Star13 - direction
	Star14 - direction
	Planet15 - direction
	Phenomenon16 - direction
)
(:init
	(supports instrument0 thermograph2)
	(calibration_target instrument0 GroundStation1)
	(calibration_target instrument0 Star3)
	(supports instrument1 image3)
	(supports instrument1 thermograph2)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 GroundStation0)
	(supports instrument2 image3)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 Star3)
	(calibration_target instrument2 Star6)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star6)
	(supports instrument3 spectrograph0)
	(supports instrument3 image3)
	(supports instrument3 thermograph2)
	(supports instrument3 thermograph1)
	(calibration_target instrument3 GroundStation2)
	(supports instrument4 thermograph2)
	(calibration_target instrument4 GroundStation2)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet15)
)
(:goal (and
	(have_image Star7 thermograph1)
	(have_image Phenomenon8 spectrograph0)
	(have_image Star9 spectrograph0)
	(have_image Planet10 thermograph1)
	(have_image Phenomenon11 image3)
	(have_image Star12 thermograph1)
	(have_image Star13 thermograph1)
	(have_image Star14 thermograph1)
	(have_image Planet15 thermograph1)
	(have_image Phenomenon16 image3)
))

)

; plan
1. (turn_to satellite1 groundstation2 planet15)
   deleted: (pointing satellite1 planet15)
   added: (pointing satellite1 groundstation2)
   goals met: 0 of 10
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 10
3. (calibrate satellite1 instrument3 groundstation2)
   added: (calibrated instrument3)
   goals met: 0 of 10
4. (turn_to satellite1 phenomenon8 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 phenomenon8)
   goals met: 0 of 10
5. (take_image satellite1 phenomenon8 instrument3 spectrograph0)
   added: (have_image phenomenon8 spectrograph0)
   goals met: 1 of 10
6. (turn_to satellite1 phenomenon16 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 phenomenon16)
   goals met: 1 of 10
7. (take_image satellite1 phenomenon16 instrument3 image3)
   added: (have_image phenomenon16 image3)
   goals met: 2 of 10
8. (turn_to satellite1 phenomenon11 phenomenon16)
   deleted: (pointing satellite1 phenomenon16)
   added: (pointing satellite1 phenomenon11)
   goals met: 2 of 10
9. (take_image satellite1 phenomenon11 instrument3 image3)
   added: (have_image phenomenon11 image3)
   goals met: 3 of 10
10. (turn_to satellite1 planet10 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 planet10)
   goals met: 3 of 10
11. (take_image satellite1 planet10 instrument3 thermograph1)
   added: (have_image planet10 thermograph1)
   goals met: 4 of 10
12. (turn_to satellite1 planet15 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 planet15)
   goals met: 4 of 10
13. (take_image satellite1 planet15 instrument3 thermograph1)
   added: (have_image planet15 thermograph1)
   goals met: 5 of 10
14. (turn_to satellite1 star12 planet15)
   deleted: (pointing satellite1 planet15)
   added: (pointing satellite1 star12)
   goals met: 5 of 10
15. (take_image satellite1 star12 instrument3 thermograph1)
   added: (have_image star12 thermograph1)
   goals met: 6 of 10
16. (turn_to satellite1 star13 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 star13)
   goals met: 6 of 10
17. (take_image satellite1 star13 instrument3 thermograph1)
   added: (have_image star13 thermograph1)
   goals met: 7 of 10
18. (turn_to satellite1 star14 star13)
   deleted: (pointing satellite1 star13)
   added: (pointing satellite1 star14)
   goals met: 7 of 10
19. (take_image satellite1 star14 instrument3 thermograph1)
   added: (have_image star14 thermograph1)
   goals met: 8 of 10
20. (turn_to satellite1 star7 star14)
   deleted: (pointing satellite1 star14)
   added: (pointing satellite1 star7)
   goals met: 8 of 10
21. (take_image satellite1 star7 instrument3 thermograph1)
   added: (have_image star7 thermograph1)
   goals met: 9 of 10
22. (turn_to satellite1 star9 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 star9)
   goals met: 9 of 10
23. (take_image satellite1 star9 instrument3 spectrograph0)
   added: (have_image star9 spectrograph0)
   goals met: 10 of 10
